package me.espoo.upgrade;

import java.io.File;
import java.io.IOException;
import java.util.ArrayList;

import org.bukkit.configuration.file.YamlConfiguration;

public class Waepon {
    public static final ArrayList<ArrayList<String>> WaeponList = new ArrayList<ArrayList<String>>();
	public static final ArrayList<String> v1 = new ArrayList<String>();
	public static final ArrayList<String> v2 = new ArrayList<String>();
	public static final ArrayList<String> v3 = new ArrayList<String>();
	public static final ArrayList<String> v4 = new ArrayList<String>();
	public static final ArrayList<String> v5 = new ArrayList<String>();
	public static final ArrayList<String> v6 = new ArrayList<String>();
	public static final ArrayList<String> v7 = new ArrayList<String>();
	public static final ArrayList<String> v8 = new ArrayList<String>();
	public static final ArrayList<String> v9 = new ArrayList<String>();
	public static final ArrayList<String> v10 = new ArrayList<String>();
	public static final ArrayList<String> v11 = new ArrayList<String>();
	public static final ArrayList<String> v12 = new ArrayList<String>();
	public static final ArrayList<String> v13 = new ArrayList<String>();
	public static final ArrayList<String> v14 = new ArrayList<String>();
	public static final ArrayList<String> v15 = new ArrayList<String>();
	public static final ArrayList<String> v16 = new ArrayList<String>();
	public static final ArrayList<String> v17 = new ArrayList<String>();
	public static final ArrayList<String> v18 = new ArrayList<String>();
	public static final ArrayList<String> v19 = new ArrayList<String>();
	public static final ArrayList<String> v20 = new ArrayList<String>();
	public static final ArrayList<String> v21 = new ArrayList<String>();
	public static final ArrayList<String> v22 = new ArrayList<String>();
	public static final ArrayList<String> v23 = new ArrayList<String>();
	public static final ArrayList<String> v24 = new ArrayList<String>();
	public static final ArrayList<String> v25 = new ArrayList<String>();
	public static final ArrayList<String> v26 = new ArrayList<String>();
	public static final ArrayList<String> v27 = new ArrayList<String>();
	public static final ArrayList<String> v28 = new ArrayList<String>();
	
	public static void setWaepon()
	{
		WaeponList.add(v1);
		WaeponList.add(v2);
		WaeponList.add(v3);
		WaeponList.add(v4);
		WaeponList.add(v5);
		WaeponList.add(v6);
		WaeponList.add(v7);
		WaeponList.add(v8);
		WaeponList.add(v9);
		WaeponList.add(v10);
		WaeponList.add(v11);
		WaeponList.add(v12);
		WaeponList.add(v13);
		WaeponList.add(v14);
		WaeponList.add(v15);
		WaeponList.add(v16);
		WaeponList.add(v17);
		WaeponList.add(v18);
		WaeponList.add(v19);
		WaeponList.add(v20);
		WaeponList.add(v21);
		WaeponList.add(v22);
		WaeponList.add(v23);
		WaeponList.add(v24);
		WaeponList.add(v25);
		WaeponList.add(v26);
		WaeponList.add(v27);
		WaeponList.add(v28);

		v1.add("&0&0&0&0&0&4&1&f&7&l&6 타츠마키 염동력");
		v1.add("&0&0&0&0&0&4&2&0&7&l&6 타츠마키 염동력 &f+1");
		v1.add("&0&0&0&0&0&4&2&1&7&l&6 타츠마키 염동력 &f+2");
		v1.add("&0&0&0&0&0&4&2&2&7&l&6 타츠마키 염동력 &f+3");
		v1.add("&0&0&0&0&0&4&2&3&7&l&6 타츠마키 염동력 &f+4");
		v1.add("&0&0&0&0&0&4&2&4&7&l&6 타츠마키 염동력 &f+5");
		v1.add("&0&0&0&0&0&4&2&5&7&l&6 타츠마키 염동력 &f+6");
		v1.add("&0&0&0&0&0&4&2&6&7&l&6 타츠마키 염동력 &f+7");
		v1.add("&0&0&0&0&0&4&2&7&7&l&6 타츠마키 염동력 &f+8");
		v1.add("&0&0&0&0&0&4&2&8&7&l&6 타츠마키 염동력 &f+9");
		v1.add("&0&0&0&0&0&4&2&9&7&l&6 타츠마키 염동력 &f+10");
		
		v2.add("&0&0&0&0&0&5&c&b&7&l&6 레이저 빔");
		v2.add("&0&0&0&0&0&5&c&c&7&l&6 레이저 빔 &f+1");
		v2.add("&0&0&0&0&0&5&c&d&7&l&6 레이저 빔 &f+2");
		v2.add("&0&0&0&0&0&5&c&e&7&l&6 레이저 빔 &f+3");
		v2.add("&0&0&0&0&0&5&c&f&7&l&6 레이저 빔 &f+4");
		v2.add("&0&0&0&0&0&5&d&0&7&l&6 레이저 빔 &f+5");
		v2.add("&0&0&0&0&0&5&d&1&7&l&6 레이저 빔 &f+6");
		v2.add("&0&0&0&0&0&5&d&2&7&l&6 레이저 빔 &f+7");
		v2.add("&0&0&0&0&0&5&d&3&7&l&6 레이저 빔 &f+8");
		v2.add("&0&0&0&0&0&5&d&4&7&l&6 레이저 빔 &f+9");
		v2.add("&0&0&0&0&0&5&d&5&7&l&6 레이저 빔 &f+10");
		
		v3.add("&0&0&0&0&0&5&d&6&7&l&6 금속 배트");
		v3.add("&0&0&0&0&0&5&d&7&7&l&6 금속 배트 &f+1");
		v3.add("&0&0&0&0&0&5&d&8&7&l&6 금속 배트 &f+2");
		v3.add("&0&0&0&0&0&5&d&9&7&l&6 금속 배트 &f+3");
		v3.add("&0&0&0&0&0&5&d&a&7&l&6 금속 배트 &f+4");
		v3.add("&0&0&0&0&0&5&d&b&7&l&6 금속 배트 &f+5");
		v3.add("&0&0&0&0&0&5&d&c&7&l&6 금속 배트 &f+6");
		v3.add("&0&0&0&0&0&5&d&d&7&l&6 금속 배트 &f+7");
		v3.add("&0&0&0&0&0&5&d&e&7&l&6 금속 배트 &f+8");
		v3.add("&0&0&0&0&0&5&d&f&7&l&6 금속 배트 &f+9");
		v3.add("&0&0&0&0&0&5&e&0&7&l&6 금속 배트 &f+10");
		
		v4.add("&0&0&0&0&0&5&e&1&7&l&6 숟가락");
		v4.add("&0&0&0&0&0&5&e&2&7&l&6 숟가락 &f+1");
		v4.add("&0&0&0&0&0&5&e&3&7&l&6 숟가락 &f+2");
		v4.add("&0&0&0&0&0&5&e&4&7&l&6 숟가락 &f+3");
		v4.add("&0&0&0&0&0&5&e&5&7&l&6 숟가락 &f+4");
		v4.add("&0&0&0&0&0&5&e&6&7&l&6 숟가락 &f+5");
		v4.add("&0&0&0&0&0&5&e&7&7&l&6 숟가락 &f+6");
		v4.add("&0&0&0&0&0&5&e&8&7&l&6 숟가락 &f+7");
		v4.add("&0&0&0&0&0&5&e&9&7&l&6 숟가락 &f+8");
		v4.add("&0&0&0&0&0&5&e&a&7&l&6 숟가락 &f+9");
		v4.add("&0&0&0&0&0&5&e&b&7&l&6 숟가락 &f+10");
		
		v5.add("&0&0&0&0&0&5&e&c&7&l&6 메탈나이트 미사일");
		v5.add("&0&0&0&0&0&5&e&d&7&l&6 메탈나이트 미사일 &f+1");
		v5.add("&0&0&0&0&0&5&e&e&7&l&6 메탈나이트 미사일 &f+2");
		v5.add("&0&0&0&0&0&5&e&f&7&l&6 메탈나이트 미사일 &f+3");
		v5.add("&0&0&0&0&0&5&f&0&7&l&6 메탈나이트 미사일 &f+4");
		v5.add("&0&0&0&0&0&5&f&1&7&l&6 메탈나이트 미사일 &f+5");
		v5.add("&0&0&0&0&0&5&f&2&7&l&6 메탈나이트 미사일 &f+6");
		v5.add("&0&0&0&0&0&5&f&3&7&l&6 메탈나이트 미사일 &f+7");
		v5.add("&0&0&0&0&0&5&f&4&7&l&6 메탈나이트 미사일 &f+8");
		v5.add("&0&0&0&0&0&5&f&5&7&l&6 메탈나이트 미사일 &f+9");
		v5.add("&0&0&0&0&0&5&f&6&7&l&6 메탈나이트 미사일 &f+10");
		
		v6.add("&0&0&0&0&0&5&f&7&7&l&6 번견맨의 손톱");
		v6.add("&0&0&0&0&0&5&f&8&7&l&6 번견맨의 손톱 &f+1");
		v6.add("&0&0&0&0&0&5&f&9&7&l&6 번견맨의 손톱 &f+2");
		v6.add("&0&0&0&0&0&5&f&a&7&l&6 번견맨의 손톱 &f+3");
		v6.add("&0&0&0&0&0&5&f&b&7&l&6 번견맨의 손톱 &f+4");
		v6.add("&0&0&0&0&0&5&f&c&7&l&6 번견맨의 손톱 &f+5");
		v6.add("&0&0&0&0&0&5&f&d&7&l&6 번견맨의 손톱 &f+6");
		v6.add("&0&0&0&0&0&5&f&e&7&l&6 번견맨의 손톱 &f+7");
		v6.add("&0&0&0&0&0&5&f&f&7&l&6 번견맨의 손톱 &f+8");
		v6.add("&0&0&0&0&0&6&0&0&7&l&6 번견맨의 손톱 &f+9");
		v6.add("&0&0&0&0&0&6&0&1&7&l&6 번견맨의 손톱 &f+10");
		
		v7.add("&0&0&0&0&0&6&0&d&7&l&6 섬광의 플래시 검");
		v7.add("&0&0&0&0&0&6&0&e&7&l&6 섬광의 플래시 검 &f+1");
		v7.add("&0&0&0&0&0&6&0&f&7&l&6 섬광의 플래시 검 &f+2");
		v7.add("&0&0&0&0&0&6&1&0&7&l&6 섬광의 플래시 검 &f+3");
		v7.add("&0&0&0&0&0&6&1&1&7&l&6 섬광의 플래시 검 &f+4");
		v7.add("&0&0&0&0&0&6&1&2&7&l&6 섬광의 플래시 검 &f+5");
		v7.add("&0&0&0&0&0&6&1&3&7&l&6 섬광의 플래시 검 &f+6");
		v7.add("&0&0&0&0&0&6&1&4&7&l&6 섬광의 플래시 검 &f+7");
		v7.add("&0&0&0&0&0&6&1&5&7&l&6 섬광의 플래시 검 &f+8");
		v7.add("&0&0&0&0&0&6&1&6&7&l&6 섬광의 플래시 검 &f+9");
		v7.add("&0&0&0&0&0&6&1&7&7&l&6 섬광의 플래시 검 &f+10");
		
		v8.add("&0&0&0&0&0&4&2&a&7&l&6 유수암쇄권");
		v8.add("&0&0&0&0&0&4&2&b&7&l&6 유수암쇄권 &f+1");
		v8.add( "&0&0&0&0&0&4&2&c&7&l&6 유수암쇄권 &f+2");
		v8.add("&0&0&0&0&0&4&2&d&7&l&6 유수암쇄권 &f+3");
		v8.add("&0&0&0&0&0&4&2&e&7&l&6 유수암쇄권 &f+4");
		v8.add("&0&0&0&0&0&4&2&f&7&l&6 유수암쇄권 &f+5");
		v8.add("&0&0&0&0&0&4&3&0&7&l&6 유수암쇄권 &f+6");
		v8.add("&0&0&0&0&0&4&3&1&7&l&6 유수암쇄권 &f+7");
		v8.add("&0&0&0&0&0&4&3&2&7&l&6 유수암쇄권 &f+8");
		v8.add("&0&0&0&0&0&4&3&3&7&l&6 유수암쇄권 &f+9");
		v8.add("&0&0&0&0&0&4&3&4&7&l&6 유수암쇄권 &f+10");

		v9.add("&0&0&0&0&0&6&1&8&7&l&6 꽃미남 가면");
		v9.add("&0&0&0&0&0&6&1&9&7&l&6 꽃미남 가면 &f+1");
		v9.add("&0&0&0&0&0&6&1&a&7&l&6 꽃미남 가면 &f+2");
		v9.add("&0&0&0&0&0&6&1&b&7&l&6 꽃미남 가면 &f+3");
		v9.add("&0&0&0&0&0&6&1&c&7&l&6 꽃미남 가면 &f+4");
		v9.add("&0&0&0&0&0&6&1&d&7&l&6 꽃미남 가면 &f+5");
		v9.add("&0&0&0&0&0&6&1&e&7&l&6 꽃미남 가면 &f+6");
		v9.add("&0&0&0&0&0&6&1&f&7&l&6 꽃미남 가면 &f+7");
		v9.add("&0&0&0&0&0&6&2&0&7&l&6 꽃미남 가면 &f+8");
		v9.add("&0&0&0&0&0&6&2&1&7&l&6 꽃미남 가면 &f+9");
		v9.add("&0&0&0&0&0&6&2&2&7&l&6 꽃미남 가면 &f+10");

		v10.add("&0&0&0&0&0&6&2&3&7&l&6 아토믹 사무라이 검");
		v10.add("&0&0&0&0&0&6&2&4&7&l&6 아토믹 사무라이 검 &f+1");
		v10.add("&0&0&0&0&0&6&2&5&7&l&6 아토믹 사무라이 검 &f+2");
		v10.add("&0&0&0&0&0&6&2&6&7&l&6 아토믹 사무라이 검 &f+3");
		v10.add("&0&0&0&0&0&6&2&7&7&l&6 아토믹 사무라이 검 &f+4");
		v10.add("&0&0&0&0&0&6&2&8&7&l&6 아토믹 사무라이 검 &f+5");
		v10.add("&0&0&0&0&0&6&2&9&7&l&6 아토믹 사무라이 검 &f+6");
		v10.add("&0&0&0&0&0&6&2&a&7&l&6 아토믹 사무라이 검 &f+7");
		v10.add("&0&0&0&0&0&6&2&b&7&l&6 아토믹 사무라이 검 &f+8");
		v10.add("&0&0&0&0&0&6&2&c&7&l&6 아토믹 사무라이 검 &f+9");
		v10.add("&0&0&0&0&0&6&2&d&7&l&6 아토믹 사무라이 검 &f+10");

		v11.add("&0&0&0&0&0&5&c&0&7&l&6 음속의 소닉 칼");
		v11.add("&0&0&0&0&0&5&c&1&7&l&6 음속의 소닉 칼 &f+1");
		v11.add("&0&0&0&0&0&5&c&2&7&l&6 음속의 소닉 칼 &f+2");
		v11.add("&0&0&0&0&0&5&c&3&7&l&6 음속의 소닉 칼 &f+3");
		v11.add("&0&0&0&0&0&5&c&4&7&l&6 음속의 소닉 칼 &f+4");
		v11.add("&0&0&0&0&0&5&c&5&7&l&6 음속의 소닉 칼 &f+5");
		v11.add("&0&0&0&0&0&5&c&6&7&l&6 음속의 소닉 칼 &f+6");
		v11.add("&0&0&0&0&0&5&c&7&7&l&6 음속의 소닉 칼 &f+7");
		v11.add("&0&0&0&0&0&5&c&8&7&l&6 음속의 소닉 칼 &f+8");
		v11.add("&0&0&0&0&0&5&c&9&7&l&6 음속의 소닉 칼 &f+9");
		v11.add("&0&0&0&0&0&5&c&a&7&l&6 음속의 소닉 칼 &f+10");

		v12.add("&0&0&0&0&0&6&2&e&7&l&6 제노스의 파츠");
		v12.add("&0&0&0&0&0&6&2&f&7&l&6 제노스의 파츠 &f+1");
		v12.add("&0&0&0&0&0&6&3&0&7&l&6 제노스의 파츠 &f+2");
		v12.add("&0&0&0&0&0&6&3&1&7&l&6 제노스의 파츠 &f+3");
		v12.add("&0&0&0&0&0&6&3&2&7&l&6 제노스의 파츠 &f+4");
		v12.add("&0&0&0&0&0&6&3&3&7&l&6 제노스의 파츠 &f+5");
		v12.add("&0&0&0&0&0&6&3&4&7&l&6 제노스의 파츠 &f+6");
		v12.add("&0&0&0&0&0&6&3&5&7&l&6 제노스의 파츠 &f+7");
		v12.add("&0&0&0&0&0&6&3&6&7&l&6 제노스의 파츠 &f+8");
		v12.add("&0&0&0&0&0&6&3&7&7&l&6 제노스의 파츠 &f+9");
		v12.add("&0&0&0&0&0&6&3&8&7&l&6 제노스의 파츠 &f+10");

		v13.add("&0&0&0&0&0&6&3&9&7&l&6 좀비맨 도끼");
		v13.add("&0&0&0&0&0&6&3&a&7&l&6 좀비맨 도끼 &f+1");
		v13.add("&0&0&0&0&0&6&3&b&7&l&6 좀비맨 도끼 &f+2");
		v13.add("&0&0&0&0&0&6&3&c&7&l&6 좀비맨 도끼 &f+3");
		v13.add("&0&0&0&0&0&6&3&d&7&l&6 좀비맨 도끼 &f+4");
		v13.add("&0&0&0&0&0&6&3&e&7&l&6 좀비맨 도끼 &f+5");
		v13.add("&0&0&0&0&0&6&3&f&7&l&6 좀비맨 도끼 &f+6");
		v13.add("&0&0&0&0&0&6&4&0&7&l&6 좀비맨 도끼 &f+7");
		v13.add("&0&0&0&0&0&6&4&1&7&l&6 좀비맨 도끼 &f+8");
		v13.add("&0&0&0&0&0&6&4&2&7&l&6 좀비맨 도끼 &f+9");
		v13.add("&0&0&0&0&0&6&4&3&7&l&6 좀비맨 도끼 &f+10");

		v14.add("&0&0&0&0&0&6&4&4&7&l&6 검은빛의 역기");
		v14.add("&0&0&0&0&0&6&4&5&7&l&6 검은빛의 역기 &f+1");
		v14.add("&0&0&0&0&0&6&4&6&7&l&6 검은빛의 역기 &f+2");
		v14.add("&0&0&0&0&0&6&4&7&7&l&6 검은빛의 역기 &f+3");
		v14.add("&0&0&0&0&0&6&4&8&7&l&6 검은빛의 역기 &f+4");
		v14.add("&0&0&0&0&0&6&4&9&7&l&6 검은빛의 역기 &f+5");
		v14.add("&0&0&0&0&0&6&4&a&7&l&6 검은빛의 역기 &f+6");
		v14.add("&0&0&0&0&0&6&4&b&7&l&6 검은빛의 역기 &f+7");
		v14.add("&0&0&0&0&0&6&4&c&7&l&6 검은빛의 역기 &f+8");
		v14.add("&0&0&0&0&0&6&4&d&7&l&6 검은빛의 역기 &f+9");
		v14.add("&0&0&0&0&0&6&4&e&7&l&6 검은빛의 역기 &f+10");

		v15.add("&0&0&0&0&0&4&5&8&7&l&6 킹의 게임기");
		v15.add("&0&0&0&0&0&4&5&9&7&l&6 킹의 게임기 &f+1");
		v15.add("&0&0&0&0&0&4&5&a&7&l&6 킹의 게임기 &f+2");
		v15.add("&0&0&0&0&0&4&5&b&7&l&6 킹의 게임기 &f+3");
		v15.add("&0&0&0&0&0&4&5&c&7&l&6 킹의 게임기 &f+4");
		v15.add("&0&0&0&0&0&4&5&d&7&l&6 킹의 게임기 &f+5");
		v15.add("&0&0&0&0&0&4&5&e&7&l&6 킹의 게임기 &f+6");
		v15.add("&0&0&0&0&0&4&5&f&7&l&6 킹의 게임기 &f+7");
		v15.add("&0&0&0&0&0&4&6&0&7&l&6 킹의 게임기 &f+8");
		v15.add("&0&0&0&0&0&4&6&1&7&l&6 킹의 게임기 &f+9");
		v15.add("&0&0&0&0&0&4&6&2&7&l&6 킹의 게임기 &f+10");

		v16.add("&0&0&0&0&0&6&4&f&7&l&6 탱크톱 마스터 근육");
		v16.add("&0&0&0&0&0&6&5&0&7&l&6 탱크톱 마스터 근육 &f+1");
		v16.add("&0&0&0&0&0&6&5&1&7&l&6 탱크톱 마스터 근육 &f+2");
		v16.add("&0&0&0&0&0&6&5&2&7&l&6 탱크톱 마스터 근육 &f+3");
		v16.add("&0&0&0&0&0&6&5&3&7&l&6 탱크톱 마스터 근육 &f+4");
		v16.add("&0&0&0&0&0&6&5&4&7&l&6 탱크톱 마스터 근육 &f+5");
		v16.add("&0&0&0&0&0&6&5&5&7&l&6 탱크톱 마스터 근육 &f+6");
		v16.add("&0&0&0&0&0&6&5&6&7&l&6 탱크톱 마스터 근육 &f+7");
		v16.add("&0&0&0&0&0&6&5&7&7&l&6 탱크톱 마스터 근육 &f+8");
		v16.add("&0&0&0&0&0&6&5&8&7&l&6 탱크톱 마스터 근육 &f+9");
		v16.add("&0&0&0&0&0&6&5&9&7&l&6 탱크톱 마스터 근육 &f+10");

		v17.add("&0&0&0&0&0&6&5&a&7&l&6 엔젤 스타일");
		v17.add("&0&0&0&0&0&6&5&b&7&l&6 엔젤 스타일 &f+1");
		v17.add("&0&0&0&0&0&6&5&c&7&l&6 엔젤 스타일 &f+2");
		v17.add("&0&0&0&0&0&6&5&d&7&l&6 엔젤 스타일 &f+3");
		v17.add("&0&0&0&0&0&6&5&e&7&l&6 엔젤 스타일 &f+4");
		v17.add("&0&0&0&0&0&6&5&f&7&l&6 엔젤 스타일 &f+5");
		v17.add("&0&0&0&0&0&6&6&0&7&l&6 엔젤 스타일 &f+6");
		v17.add("&0&0&0&0&0&6&6&1&7&l&6 엔젤 스타일 &f+7");
		v17.add("&0&0&0&0&0&6&6&2&7&l&6 엔젤 스타일 &f+8");
		v17.add("&0&0&0&0&0&6&6&3&7&l&6 엔젤 스타일 &f+9");
		v17.add("&0&0&0&0&0&6&6&4&7&l&6 엔젤 스타일 &f+10");

		v18.add("&0&0&0&0&0&6&6&5&7&l&6 후부키 염동력");
		v18.add("&0&0&0&0&0&6&6&6&7&l&6 후부키 염동력 &f+1");
		v18.add("&0&0&0&0&0&6&6&7&7&l&6 후부키 염동력 &f+2");
		v18.add("&0&0&0&0&0&6&6&8&7&l&6 후부키 염동력 &f+3");
		v18.add("&0&0&0&0&0&6&6&9&7&l&6 후부키 염동력 &f+4");
		v18.add("&0&0&0&0&0&6&6&a&7&l&6 후부키 염동력 &f+5");
		v18.add("&0&0&0&0&0&6&6&b&7&l&6 후부키 염동력 &f+6");
		v18.add("&0&0&0&0&0&6&6&c&7&l&6 후부키 염동력 &f+7");
		v18.add("&0&0&0&0&0&6&6&d&7&l&6 후부키 염동력 &f+8");
		v18.add("&0&0&0&0&0&6&6&e&7&l&6 후부키 염동력 &f+9");
		v18.add("&0&0&0&0&0&6&6&f&7&l&6 후부키 염동력 &f+10");

		v19.add("&0&0&0&0&0&6&8&7&7&l&6 동제 머신건");
		v19.add("&0&0&0&0&0&6&8&8&7&l&6 동제 머신건 &f+1");
		v19.add("&0&0&0&0&0&6&8&9&7&l&6 동제 머신건 &f+2");
		v19.add("&0&0&0&0&0&6&8&a&7&l&6 동제 머신건 &f+3");
		v19.add("&0&0&0&0&0&6&8&b&7&l&6 동제 머신건 &f+4");
		v19.add("&0&0&0&0&0&6&8&c&7&l&6 동제 머신건 &f+5");
		v19.add("&0&0&0&0&0&6&8&d&7&l&6 동제 머신건 &f+6");
		v19.add("&0&0&0&0&0&6&8&e&7&l&6 동제 머신건 &f+7");
		v19.add("&0&0&0&0&0&6&8&f&7&l&6 동제 머신건 &f+8");
		v19.add("&0&0&0&0&0&6&9&0&7&l&6 동제 머신건 &f+9");
		v19.add("&0&0&0&0&0&6&9&1&7&l&6 동제 머신건 &f+10");

		v20.add("&0&0&0&0&0&7&0&0&7&l&c 불 속성 &6룬");
		v20.add("&0&0&0&0&0&7&0&1&7&l&c 불 속성 &6룬 &f+1");
		v20.add("&0&0&0&0&0&7&0&2&7&l&c 불 속성 &6룬 &f+2");
		v20.add("&0&0&0&0&0&7&0&3&7&l&c 불 속성 &6룬 &f+3");
		v20.add("&0&0&0&0&0&7&0&4&7&l&c 불 속성 &6룬 &f+4");
		v20.add("&0&0&0&0&0&7&0&5&7&l&c 불 속성 &6룬 &f+5");
		v20.add("&0&0&0&0&0&7&0&6&7&l&c 불 속성 &6룬 &f+6");
		v20.add("&0&0&0&0&0&7&0&7&7&l&c 불 속성 &6룬 &f+7");
		v20.add("&0&0&0&0&0&7&0&8&7&l&c 불 속성 &6룬 &f+8");
		v20.add("&0&0&0&0&0&7&0&9&7&l&c 불 속성 &6룬 &f+9");
		v20.add("&0&0&0&0&0&7&0&a&7&l&c 불 속성 &6룬 &f+10");

		v21.add("&0&0&0&0&0&7&5&8&7&l&b 바람 속성 &6룬");
		v21.add("&0&0&0&0&0&7&5&9&7&l&b 바람 속성 &6룬 &f+1");
		v21.add("&0&0&0&0&0&7&5&a&7&l&b 바람 속성 &6룬 &f+2");
		v21.add("&0&0&0&0&0&7&5&b&7&l&b 바람 속성 &6룬 &f+3");
		v21.add("&0&0&0&0&0&7&5&c&7&l&b 바람 속성 &6룬 &f+4");
		v21.add("&0&0&0&0&0&7&5&d&7&l&b 바람 속성 &6룬 &f+5");
		v21.add("&0&0&0&0&0&7&5&e&7&l&b 바람 속성 &6룬 &f+6");
		v21.add("&0&0&0&0&0&7&5&f&7&l&b 바람 속성 &6룬 &f+7");
		v21.add("&0&0&0&0&0&7&6&0&7&l&b 바람 속성 &6룬 &f+8");
		v21.add("&0&0&0&0&0&7&6&1&7&l&b 바람 속성 &6룬 &f+9");
		v21.add("&0&0&0&0&0&7&6&2&7&l&b 바람 속성 &6룬 &f+10");

		v22.add("&0&0&0&0&0&7&2&1&7&l&d 치유 속성 &6룬");
		v22.add("&0&0&0&0&0&7&2&2&7&l&d 치유 속성 &6룬 &f+1");
		v22.add("&0&0&0&0&0&7&2&3&7&l&d 치유 속성 &6룬 &f+2");
		v22.add("&0&0&0&0&0&7&2&4&7&l&d 치유 속성 &6룬 &f+3");
		v22.add("&0&0&0&0&0&7&2&5&7&l&d 치유 속성 &6룬 &f+4");
		v22.add("&0&0&0&0&0&7&2&6&7&l&d 치유 속성 &6룬 &f+5");
		v22.add("&0&0&0&0&0&7&2&7&7&l&d 치유 속성 &6룬 &f+6");
		v22.add("&0&0&0&0&0&7&2&8&7&l&d 치유 속성 &6룬 &f+7");
		v22.add("&0&0&0&0&0&7&2&9&7&l&d 치유 속성 &6룬 &f+8");
		v22.add("&0&0&0&0&0&7&2&a&7&l&d 치유 속성 &6룬 &f+9");
		v22.add("&0&0&0&0&0&7&2&b&7&l&d 치유 속성 &6룬 &f+10");

		v23.add("&0&0&0&0&0&7&2&c&7&l&7&l 어둠 속성 &6룬");
		v23.add("&0&0&0&0&0&7&2&d&7&l&7&l 어둠 속성 &6룬 &f+1");
		v23.add("&0&0&0&0&0&7&2&e&7&l&7&l 어둠 속성 &6룬 &f+2");
		v23.add("&0&0&0&0&0&7&2&f&7&l&7&l 어둠 속성 &6룬 &f+3");
		v23.add("&0&0&0&0&0&7&3&0&7&l&7&l 어둠 속성 &6룬 &f+4");
		v23.add("&0&0&0&0&0&7&3&1&7&l&7&l 어둠 속성 &6룬 &f+5");
		v23.add("&0&0&0&0&0&7&3&2&7&l&7&l 어둠 속성 &6룬 &f+6");
		v23.add("&0&0&0&0&0&7&3&3&7&l&7&l 어둠 속성 &6룬 &f+7");
		v23.add("&0&0&0&0&0&7&3&4&7&l&7&l 어둠 속성 &6룬 &f+8");
		v23.add("&0&0&0&0&0&7&3&5&7&l&7&l 어둠 속성 &6룬 &f+9");
		v23.add("&0&0&0&0&0&7&3&6&7&l&7&l 어둠 속성 &6룬 &f+10");

		v24.add("&0&0&0&0&0&7&3&7&7&l&a 독 속성 &6룬");
		v24.add("&0&0&0&0&0&7&3&8&7&l&a 독 속성 &6룬 &f+1");
		v24.add("&0&0&0&0&0&7&3&9&7&l&a 독 속성 &6룬 &f+2");
		v24.add("&0&0&0&0&0&7&3&a&7&l&a 독 속성 &6룬 &f+3");
		v24.add("&0&0&0&0&0&7&3&b&7&l&a 독 속성 &6룬 &f+4");
		v24.add("&0&0&0&0&0&7&3&c&7&l&a 독 속성 &6룬 &f+5");
		v24.add("&0&0&0&0&0&7&3&d&7&l&a 독 속성 &6룬 &f+6");
		v24.add("&0&0&0&0&0&7&3&e&7&l&a 독 속성 &6룬 &f+7");
		v24.add("&0&0&0&0&0&7&3&f&7&l&a 독 속성 &6룬 &f+8");
		v24.add("&0&0&0&0&0&7&4&0&7&l&a 독 속성 &6룬 &f+9");
		v24.add("&0&0&0&0&0&7&4&1&7&l&a 독 속성 &6룬 &f+10");

		v25.add("&0&0&0&0&0&7&4&2&7&l&e 부패 속성 &6룬");
		v25.add("&0&0&0&0&0&7&4&3&7&l&e 부패 속성 &6룬 &f+1");
		v25.add("&0&0&0&0&0&7&4&4&7&l&e 부패 속성 &6룬 &f+2");
		v25.add("&0&0&0&0&0&7&4&5&7&l&e 부패 속성 &6룬 &f+3");
		v25.add("&0&0&0&0&0&7&4&6&7&l&e 부패 속성 &6룬 &f+4");
		v25.add("&0&0&0&0&0&7&4&7&7&l&e 부패 속성 &6룬 &f+5");
		v25.add("&0&0&0&0&0&7&4&8&7&l&e 부패 속성 &6룬 &f+6");
		v25.add("&0&0&0&0&0&7&4&9&7&l&e 부패 속성 &6룬 &f+7");
		v25.add("&0&0&0&0&0&7&4&a&7&l&e 부패 속성 &6룬 &f+8");
		v25.add("&0&0&0&0&0&7&4&b&7&l&e 부패 속성 &6룬 &f+9");
		v25.add("&0&0&0&0&0&7&4&c&7&l&e 부패 속성 &6룬 &f+10");

		v26.add("&0&0&0&0&0&7&4&d&7&l&3 얼음 속성 &6룬");
		v26.add("&0&0&0&0&0&7&4&e&7&l&3 얼음 속성 &6룬 &f+1");
		v26.add("&0&0&0&0&0&7&4&f&7&l&3 얼음 속성 &6룬 &f+2");
		v26.add("&0&0&0&0&0&7&5&0&7&l&3 얼음 속성 &6룬 &f+3");
		v26.add("&0&0&0&0&0&7&5&1&7&l&3 얼음 속성 &6룬 &f+4");
		v26.add("&0&0&0&0&0&7&5&2&7&l&3 얼음 속성 &6룬 &f+5");
		v26.add("&0&0&0&0&0&7&5&3&7&l&3 얼음 속성 &6룬 &f+6");
		v26.add("&0&0&0&0&0&7&5&4&7&l&3 얼음 속성 &6룬 &f+7");
		v26.add("&0&0&0&0&0&7&5&5&7&l&3 얼음 속성 &6룬 &f+8");
		v26.add("&0&0&0&0&0&7&5&6&7&l&3 얼음 속성 &6룬 &f+9");
		v26.add("&0&0&0&0&0&7&5&7&7&l&3 얼음 속성 &6룬 &f+10");
		
        v27.add("&0&0&0&0&0&7&d&2&7&l&6 히든 속성 &6룬");
        v27.add("&0&0&0&0&0&7&d&3&7&l&6 히든 속성 &6룬 &f+1");
        v27.add("&0&0&0&0&0&7&d&4&7&l&6 히든 속성 &6룬 &f+2");
        v27.add("&0&0&0&0&0&7&d&5&7&l&6 히든 속성 &6룬 &f+3");
        v27.add("&0&0&0&0&0&7&d&6&7&l&6 히든 속성 &6룬 &f+4");
        v27.add("&0&0&0&0&0&7&d&7&7&l&6 히든 속성 &6룬 &f+5");
        v27.add("&0&0&0&0&0&7&d&8&7&l&6 히든 속성 &6룬 &f+6");
        v27.add("&0&0&0&0&0&7&d&9&7&l&6 히든 속성 &6룬 &f+7");
        v27.add("&0&0&0&0&0&7&d&a&7&l&6 히든 속성 &6룬 &f+8");
        v27.add("&0&0&0&0&0&7&d&b&7&l&6 히든 속성 &6룬 &f+9");
        v27.add("&0&0&0&0&0&7&d&c&7&l&6 히든 속성 &6룬 &f+10");
        
        v28.add("&0&0&0&0&0&7&c&7&7&l&6 사이타마 장갑");
        v28.add("&0&0&0&0&0&7&c&8&7&l&6 사이타마 장갑 &f+1");
        v28.add("&0&0&0&0&0&7&c&9&7&l&6 사이타마 장갑 &f+2");
        v28.add("&0&0&0&0&0&7&c&a&7&l&6 사이타마 장갑 &f+3");
        v28.add("&0&0&0&0&0&7&c&b&7&l&6 사이타마 장갑 &f+4");
        v28.add("&0&0&0&0&0&7&c&c&7&l&6 사이타마 장갑 &f+5");
        v28.add("&0&0&0&0&0&7&c&d&7&l&6 사이타마 장갑 &f+6");
        v28.add("&0&0&0&0&0&7&c&e&7&l&6 사이타마 장갑 &f+7");
        v28.add("&0&0&0&0&0&7&c&f&7&l&6 사이타마 장갑 &f+8");
        v28.add("&0&0&0&0&0&7&d&0&7&l&6 사이타마 장갑 &f+9");
        v28.add("&0&0&0&0&0&7&d&1&7&l&6 사이타마 장갑 &f+10");
	}
	
	public static void CreateWaeponConfig(File f, File folder, YamlConfiguration config)
	{
		try
		{
			folder.mkdir();
			f.createNewFile();
			
            config.set("1.1", "&0&0&0&0&0&4&1&f&7&l&6 타츠마키 염동력");
            config.set("1.2", "&0&0&0&0&0&4&2&0&7&l&6 타츠마키 염동력 &f+1");
            config.set("1.3", "&0&0&0&0&0&4&2&1&7&l&6 타츠마키 염동력 &f+2");
            config.set("1.4", "&0&0&0&0&0&4&2&2&7&l&6 타츠마키 염동력 &f+3");
            config.set("1.5", "&0&0&0&0&0&4&2&3&7&l&6 타츠마키 염동력 &f+4");
            config.set("1.6", "&0&0&0&0&0&4&2&4&7&l&6 타츠마키 염동력 &f+5");
            config.set("1.7", "&0&0&0&0&0&4&2&5&7&l&6 타츠마키 염동력 &f+6");
            config.set("1.8", "&0&0&0&0&0&4&2&6&7&l&6 타츠마키 염동력 &f+7");
            config.set("1.9", "&0&0&0&0&0&4&2&7&7&l&6 타츠마키 염동력 &f+8");
            config.set("1.10", "&0&0&0&0&0&4&2&8&7&l&6 타츠마키 염동력 &f+9");
            config.set("1.11", "&0&0&0&0&0&4&2&9&7&l&6 타츠마키 염동력 &f+10");
            
            config.set("2.1", "&0&0&0&0&0&5&c&b&7&l&6 레이저 빔");
            config.set("2.2", "&0&0&0&0&0&5&c&c&7&l&6 레이저 빔 &f+1");
            config.set("2.3", "&0&0&0&0&0&5&c&d&7&l&6 레이저 빔 &f+2");
            config.set("2.4", "&0&0&0&0&0&5&c&e&7&l&6 레이저 빔 &f+3");
            config.set("2.5", "&0&0&0&0&0&5&c&f&7&l&6 레이저 빔 &f+4");
            config.set("2.6", "&0&0&0&0&0&5&d&0&7&l&6 레이저 빔 &f+5");
            config.set("2.7", "&0&0&0&0&0&5&d&1&7&l&6 레이저 빔 &f+6");
            config.set("2.8", "&0&0&0&0&0&5&d&2&7&l&6 레이저 빔 &f+7");
            config.set("2.9", "&0&0&0&0&0&5&d&3&7&l&6 레이저 빔 &f+8");
            config.set("2.10", "&0&0&0&0&0&5&d&4&7&l&6 레이저 빔 &f+9");
            config.set("2.11", "&0&0&0&0&0&5&d&5&7&l&6 레이저 빔 &f+10");
            
            config.set("3.1", "&0&0&0&0&0&5&d&6&7&l&6 금속 배트");
            config.set("3.2", "&0&0&0&0&0&5&d&7&7&l&6 금속 배트 &f+1");
            config.set("3.3", "&0&0&0&0&0&5&d&8&7&l&6 금속 배트 &f+2");
            config.set("3.4", "&0&0&0&0&0&5&d&9&7&l&6 금속 배트 &f+3");
            config.set("3.5", "&0&0&0&0&0&5&d&a&7&l&6 금속 배트 &f+4");
            config.set("3.6", "&0&0&0&0&0&5&d&b&7&l&6 금속 배트 &f+5");
            config.set("3.7", "&0&0&0&0&0&5&d&c&7&l&6 금속 배트 &f+6");
            config.set("3.8", "&0&0&0&0&0&5&d&d&7&l&6 금속 배트 &f+7");
            config.set("3.9", "&0&0&0&0&0&5&d&e&7&l&6 금속 배트 &f+8");
            config.set("3.10", "&0&0&0&0&0&5&d&f&7&l&6 금속 배트 &f+9");
            config.set("3.11", "&0&0&0&0&0&5&e&0&7&l&6 금속 배트 &f+10");
            
            config.set("4.1", "&0&0&0&0&0&5&e&1&7&l&6 숟가락");
            config.set("4.2", "&0&0&0&0&0&5&e&2&7&l&6 숟가락 &f+1");
            config.set("4.3", "&0&0&0&0&0&5&e&3&7&l&6 숟가락 &f+2");
            config.set("4.4", "&0&0&0&0&0&5&e&4&7&l&6 숟가락 &f+3");
            config.set("4.5", "&0&0&0&0&0&5&e&5&7&l&6 숟가락 &f+4");
            config.set("4.6", "&0&0&0&0&0&5&e&6&7&l&6 숟가락 &f+5");
            config.set("4.7", "&0&0&0&0&0&5&e&7&7&l&6 숟가락 &f+6");
            config.set("4.8", "&0&0&0&0&0&5&e&8&7&l&6 숟가락 &f+7");
            config.set("4.9", "&0&0&0&0&0&5&e&9&7&l&6 숟가락 &f+8");
            config.set("4.10", "&0&0&0&0&0&5&e&a&7&l&6 숟가락 &f+9");
            config.set("4.11", "&0&0&0&0&0&5&e&b&7&l&6 숟가락 &f+10");
            
            config.set("5.1", "&0&0&0&0&0&5&e&c&7&l&6 메탈나이트 미사일");
            config.set("5.2", "&0&0&0&0&0&5&e&d&7&l&6 메탈나이트 미사일 &f+1");
            config.set("5.3", "&0&0&0&0&0&5&e&e&7&l&6 메탈나이트 미사일 &f+2");
            config.set("5.4", "&0&0&0&0&0&5&e&f&7&l&6 메탈나이트 미사일 &f+3");
            config.set("5.5", "&0&0&0&0&0&5&f&0&7&l&6 메탈나이트 미사일 &f+4");
            config.set("5.6", "&0&0&0&0&0&5&f&1&7&l&6 메탈나이트 미사일 &f+5");
            config.set("5.7", "&0&0&0&0&0&5&f&2&7&l&6 메탈나이트 미사일 &f+6");
            config.set("5.8", "&0&0&0&0&0&5&f&3&7&l&6 메탈나이트 미사일 &f+7");
            config.set("5.9", "&0&0&0&0&0&5&f&4&7&l&6 메탈나이트 미사일 &f+8");
            config.set("5.10", "&0&0&0&0&0&5&f&5&7&l&6 메탈나이트 미사일 &f+9");
            config.set("5.11", "&0&0&0&0&0&5&f&6&7&l&6 메탈나이트 미사일 &f+10");
            
            config.set("6.1", "&0&0&0&0&0&5&f&7&7&l&6 번견맨의 손톱");
            config.set("6.2", "&0&0&0&0&0&5&f&8&7&l&6 번견맨의 손톱 &f+1");
            config.set("6.3", "&0&0&0&0&0&5&f&9&7&l&6 번견맨의 손톱 &f+2");
            config.set("6.4", "&0&0&0&0&0&5&f&a&7&l&6 번견맨의 손톱 &f+3");
            config.set("6.5", "&0&0&0&0&0&5&f&b&7&l&6 번견맨의 손톱 &f+4");
            config.set("6.6", "&0&0&0&0&0&5&f&c&7&l&6 번견맨의 손톱 &f+5");
            config.set("6.7", "&0&0&0&0&0&5&f&d&7&l&6 번견맨의 손톱 &f+6");
            config.set("6.8", "&0&0&0&0&0&5&f&e&7&l&6 번견맨의 손톱 &f+7");
            config.set("6.9", "&0&0&0&0&0&5&f&f&7&l&6 번견맨의 손톱 &f+8");
            config.set("6.10", "&0&0&0&0&0&6&0&0&7&l&6 번견맨의 손톱 &f+9");
            config.set("6.11", "&0&0&0&0&0&6&0&1&7&l&6 번견맨의 손톱 &f+10");
            
            config.set("7.1", "&0&0&0&0&0&6&0&d&7&l&6 섬광의 플래시 검");
            config.set("7.2", "&0&0&0&0&0&6&0&e&7&l&6 섬광의 플래시 검 &f+1");
            config.set("7.3", "&0&0&0&0&0&6&0&f&7&l&6 섬광의 플래시 검 &f+2");
            config.set("7.4", "&0&0&0&0&0&6&1&0&7&l&6 섬광의 플래시 검 &f+3");
            config.set("7.5", "&0&0&0&0&0&6&1&1&7&l&6 섬광의 플래시 검 &f+4");
            config.set("7.6", "&0&0&0&0&0&6&1&2&7&l&6 섬광의 플래시 검 &f+5");
            config.set("7.7", "&0&0&0&0&0&6&1&3&7&l&6 섬광의 플래시 검 &f+6");
            config.set("7.8", "&0&0&0&0&0&6&1&4&7&l&6 섬광의 플래시 검 &f+7");
            config.set("7.9", "&0&0&0&0&0&6&1&5&7&l&6 섬광의 플래시 검 &f+8");
            config.set("7.10", "&0&0&0&0&0&6&1&6&7&l&6 섬광의 플래시 검 &f+9");
            config.set("7.11", "&0&0&0&0&0&6&1&7&7&l&6 섬광의 플래시 검 &f+10");
            
            config.set("8.1", "&0&0&0&0&0&4&2&a&7&l&6 유수암쇄권");
            config.set("8.2", "&0&0&0&0&0&4&2&b&7&l&6 유수암쇄권 &f+1");
            config.set("8.3", "&0&0&0&0&0&4&2&c&7&l&6 유수암쇄권 &f+2");
            config.set("8.4", "&0&0&0&0&0&4&2&d&7&l&6 유수암쇄권 &f+3");
            config.set("8.5", "&0&0&0&0&0&4&2&e&7&l&6 유수암쇄권 &f+4");
            config.set("8.6", "&0&0&0&0&0&4&2&f&7&l&6 유수암쇄권 &f+5");
            config.set("8.7", "&0&0&0&0&0&4&3&0&7&l&6 유수암쇄권 &f+6");
            config.set("8.8", "&0&0&0&0&0&4&3&1&7&l&6 유수암쇄권 &f+7");
            config.set("8.9", "&0&0&0&0&0&4&3&2&7&l&6 유수암쇄권 &f+8");
            config.set("8.10", "&0&0&0&0&0&4&3&3&7&l&6 유수암쇄권 &f+9");
            config.set("8.11", "&0&0&0&0&0&4&3&4&7&l&6 유수암쇄권 &f+10");
            
            config.set("9.1", "&0&0&0&0&0&6&1&8&7&l&6 꽃미남 가면");
            config.set("9.2", "&0&0&0&0&0&6&1&9&7&l&6 꽃미남 가면 &f+1");
            config.set("9.3", "&0&0&0&0&0&6&1&a&7&l&6 꽃미남 가면 &f+2");
            config.set("9.4", "&0&0&0&0&0&6&1&b&7&l&6 꽃미남 가면 &f+3");
            config.set("9.5", "&0&0&0&0&0&6&1&c&7&l&6 꽃미남 가면 &f+4");
            config.set("9.6", "&0&0&0&0&0&6&1&d&7&l&6 꽃미남 가면 &f+5");
            config.set("9.7", "&0&0&0&0&0&6&1&e&7&l&6 꽃미남 가면 &f+6");
            config.set("9.8", "&0&0&0&0&0&6&1&f&7&l&6 꽃미남 가면 &f+7");
            config.set("9.9", "&0&0&0&0&0&6&2&0&7&l&6 꽃미남 가면 &f+8");
            config.set("9.10", "&0&0&0&0&0&6&2&1&7&l&6 꽃미남 가면 &f+9");
            config.set("9.11", "&0&0&0&0&0&6&2&2&7&l&6 꽃미남 가면 &f+10");
            
            config.set("10.1", "&0&0&0&0&0&6&2&3&7&l&6 아토믹 사무라이 검");
            config.set("10.2", "&0&0&0&0&0&6&2&4&7&l&6 아토믹 사무라이 검 &f+1");
            config.set("10.3", "&0&0&0&0&0&6&2&5&7&l&6 아토믹 사무라이 검 &f+2");
            config.set("10.4", "&0&0&0&0&0&6&2&6&7&l&6 아토믹 사무라이 검 &f+3");
            config.set("10.5", "&0&0&0&0&0&6&2&7&7&l&6 아토믹 사무라이 검 &f+4");
            config.set("10.6", "&0&0&0&0&0&6&2&8&7&l&6 아토믹 사무라이 검 &f+5");
            config.set("10.7", "&0&0&0&0&0&6&2&9&7&l&6 아토믹 사무라이 검 &f+6");
            config.set("10.8", "&0&0&0&0&0&6&2&a&7&l&6 아토믹 사무라이 검 &f+7");
            config.set("10.9", "&0&0&0&0&0&6&2&b&7&l&6 아토믹 사무라이 검 &f+8");
            config.set("10.10", "&0&0&0&0&0&6&2&c&7&l&6 아토믹 사무라이 검 &f+9");
            config.set("10.11", "&0&0&0&0&0&6&2&d&7&l&6 아토믹 사무라이 검 &f+10");
            
            config.set("11.1", "&0&0&0&0&0&5&c&0&7&l&6 음속의 소닉 칼");
            config.set("11.2", "&0&0&0&0&0&5&c&1&7&l&6 음속의 소닉 칼 &f+1");
            config.set("11.3", "&0&0&0&0&0&5&c&2&7&l&6 음속의 소닉 칼 &f+2");
            config.set("11.4", "&0&0&0&0&0&5&c&3&7&l&6 음속의 소닉 칼 &f+3");
            config.set("11.5", "&0&0&0&0&0&5&c&4&7&l&6 음속의 소닉 칼 &f+4");
            config.set("11.6", "&0&0&0&0&0&5&c&5&7&l&6 음속의 소닉 칼 &f+5");
            config.set("11.7", "&0&0&0&0&0&5&c&6&7&l&6 음속의 소닉 칼 &f+6");
            config.set("11.8", "&0&0&0&0&0&5&c&7&7&l&6 음속의 소닉 칼 &f+7");
            config.set("11.9", "&0&0&0&0&0&5&c&8&7&l&6 음속의 소닉 칼 &f+8");
            config.set("11.10", "&0&0&0&0&0&5&c&9&7&l&6 음속의 소닉 칼 &f+9");
            config.set("11.11", "&0&0&0&0&0&5&c&a&7&l&6 음속의 소닉 칼 &f+10");
            
            config.set("12.1", "&0&0&0&0&0&6&2&e&7&l&6 제노스의 파츠");
            config.set("12.2", "&0&0&0&0&0&6&2&f&7&l&6 제노스의 파츠 &f+1");
            config.set("12.3", "&0&0&0&0&0&6&3&0&7&l&6 제노스의 파츠 &f+2");
            config.set("12.4", "&0&0&0&0&0&6&3&1&7&l&6 제노스의 파츠 &f+3");
            config.set("12.5", "&0&0&0&0&0&6&3&2&7&l&6 제노스의 파츠 &f+4");
            config.set("12.6", "&0&0&0&0&0&6&3&3&7&l&6 제노스의 파츠 &f+5");
            config.set("12.7", "&0&0&0&0&0&6&3&4&7&l&6 제노스의 파츠 &f+6");
            config.set("12.8", "&0&0&0&0&0&6&3&5&7&l&6 제노스의 파츠 &f+7");
            config.set("12.9", "&0&0&0&0&0&6&3&6&7&l&6 제노스의 파츠 &f+8");
            config.set("12.10", "&0&0&0&0&0&6&3&7&7&l&6 제노스의 파츠 &f+9");
            config.set("12.11", "&0&0&0&0&0&6&3&8&7&l&6 제노스의 파츠 &f+10");
            
            config.set("13.1", "&0&0&0&0&0&6&3&9&7&l&6 좀비맨 도끼");
            config.set("13.2", "&0&0&0&0&0&6&3&a&7&l&6 좀비맨 도끼 &f+1");
            config.set("13.3", "&0&0&0&0&0&6&3&b&7&l&6 좀비맨 도끼 &f+2");
            config.set("13.4", "&0&0&0&0&0&6&3&c&7&l&6 좀비맨 도끼 &f+3");
            config.set("13.5", "&0&0&0&0&0&6&3&d&7&l&6 좀비맨 도끼 &f+4");
            config.set("13.6", "&0&0&0&0&0&6&3&e&7&l&6 좀비맨 도끼 &f+5");
            config.set("13.7", "&0&0&0&0&0&6&3&f&7&l&6 좀비맨 도끼 &f+6");
            config.set("13.8", "&0&0&0&0&0&6&4&0&7&l&6 좀비맨 도끼 &f+7");
            config.set("13.9", "&0&0&0&0&0&6&4&1&7&l&6 좀비맨 도끼 &f+8");
            config.set("13.10", "&0&0&0&0&0&6&4&2&7&l&6 좀비맨 도끼 &f+9");
            config.set("13.11", "&0&0&0&0&0&6&4&3&7&l&6 좀비맨 도끼 &f+10");
            
            config.set("14.1", "&0&0&0&0&0&6&4&4&7&l&6 검은빛의 역기");
            config.set("14.2", "&0&0&0&0&0&6&4&5&7&l&6 검은빛의 역기 &f+1");
            config.set("14.3", "&0&0&0&0&0&6&4&6&7&l&6 검은빛의 역기 &f+2");
            config.set("14.4", "&0&0&0&0&0&6&4&7&7&l&6 검은빛의 역기 &f+3");
            config.set("14.5", "&0&0&0&0&0&6&4&8&7&l&6 검은빛의 역기 &f+4");
            config.set("14.6", "&0&0&0&0&0&6&4&9&7&l&6 검은빛의 역기 &f+5");
            config.set("14.7", "&0&0&0&0&0&6&4&a&7&l&6 검은빛의 역기 &f+6");
            config.set("14.8", "&0&0&0&0&0&6&4&b&7&l&6 검은빛의 역기 &f+7");
            config.set("14.9", "&0&0&0&0&0&6&4&c&7&l&6 검은빛의 역기 &f+8");
            config.set("14.10", "&0&0&0&0&0&6&4&d&7&l&6 검은빛의 역기 &f+9");
            config.set("14.11", "&0&0&0&0&0&6&4&e&7&l&6 검은빛의 역기 &f+10");
            
            config.set("15.1", "&0&0&0&0&0&6&5&8&7&l&6 킹의 게임기");
            config.set("15.2", "&0&0&0&0&0&6&5&9&7&l&6 킹의 게임기 &f+1");
            config.set("15.3", "&0&0&0&0&0&6&5&a&7&l&6 킹의 게임기 &f+2");
            config.set("15.4", "&0&0&0&0&0&6&5&b&7&l&6 킹의 게임기 &f+3");
            config.set("15.5", "&0&0&0&0&0&6&5&c&7&l&6 킹의 게임기 &f+4");
            config.set("15.6", "&0&0&0&0&0&6&5&d&7&l&6 킹의 게임기 &f+5");
            config.set("15.7", "&0&0&0&0&0&6&5&e&7&l&6 킹의 게임기 &f+6");
            config.set("15.8", "&0&0&0&0&0&6&5&f&7&l&6 킹의 게임기 &f+7");
            config.set("15.9", "&0&0&0&0&0&6&6&0&7&l&6 킹의 게임기 &f+8");
            config.set("15.10", "&0&0&0&0&0&6&6&1&7&l&6 킹의 게임기 &f+9");
            config.set("15.11", "&0&0&0&0&0&6&6&2&7&l&6 킹의 게임기 &f+10");
            
            config.set("16.1", "&0&0&0&0&0&6&4&f&7&l&6 탱크톱 마스터 근육");
            config.set("16.2", "&0&0&0&0&0&6&5&0&7&l&6 탱크톱 마스터 근육 &f+1");
            config.set("16.3", "&0&0&0&0&0&6&5&1&7&l&6 탱크톱 마스터 근육 &f+2");
            config.set("16.4", "&0&0&0&0&0&6&5&2&7&l&6 탱크톱 마스터 근육 &f+3");
            config.set("16.5", "&0&0&0&0&0&6&5&3&7&l&6 탱크톱 마스터 근육 &f+4");
            config.set("16.6", "&0&0&0&0&0&6&5&4&7&l&6 탱크톱 마스터 근육 &f+5");
            config.set("16.7", "&0&0&0&0&0&6&5&5&7&l&6 탱크톱 마스터 근육 &f+6");
            config.set("16.8", "&0&0&0&0&0&6&5&6&7&l&6 탱크톱 마스터 근육 &f+7");
            config.set("16.9", "&0&0&0&0&0&6&5&7&7&l&6 탱크톱 마스터 근육 &f+8");
            config.set("16.10", "&0&0&0&0&0&6&5&8&7&l&6 탱크톱 마스터 근육 &f+9");
            config.set("16.11", "&0&0&0&0&0&6&5&9&7&l&6 탱크톱 마스터 근육 &f+10");
            
            config.set("17.1", "&0&0&0&0&0&6&5&a&7&l&6 엔젤 스타일");
            config.set("17.2", "&0&0&0&0&0&6&5&b&7&l&6 엔젤 스타일 &f+1");
            config.set("17.3", "&0&0&0&0&0&6&5&c&7&l&6 엔젤 스타일 &f+2");
            config.set("17.4", "&0&0&0&0&0&6&5&d&7&l&6 엔젤 스타일 &f+3");
            config.set("17.5", "&0&0&0&0&0&6&5&e&7&l&6 엔젤 스타일 &f+4");
            config.set("17.6", "&0&0&0&0&0&6&5&f&7&l&6 엔젤 스타일 &f+5");
            config.set("17.7", "&0&0&0&0&0&6&6&0&7&l&6 엔젤 스타일 &f+6");
            config.set("17.8", "&0&0&0&0&0&6&6&1&7&l&6 엔젤 스타일 &f+7");
            config.set("17.9", "&0&0&0&0&0&6&6&2&7&l&6 엔젤 스타일 &f+8");
            config.set("17.10", "&0&0&0&0&0&6&6&3&7&l&6 엔젤 스타일 &f+9");
            config.set("17.11", "&0&0&0&0&0&6&6&4&7&l&6 엔젤 스타일 &f+10");
            
            config.set("18.1", "&0&0&0&0&0&6&6&5&7&l&6 후부키 염동력");
            config.set("18.2", "&0&0&0&0&0&6&6&6&7&l&6 후부키 염동력 &f+1");
            config.set("18.3", "&0&0&0&0&0&6&6&7&7&l&6 후부키 염동력 &f+2");
            config.set("18.4", "&0&0&0&0&0&6&6&8&7&l&6 후부키 염동력 &f+3");
            config.set("18.5", "&0&0&0&0&0&6&6&9&7&l&6 후부키 염동력 &f+4");
            config.set("18.6", "&0&0&0&0&0&6&6&a&7&l&6 후부키 염동력 &f+5");
            config.set("18.7", "&0&0&0&0&0&6&6&b&7&l&6 후부키 염동력 &f+6");
            config.set("18.8", "&0&0&0&0&0&6&6&c&7&l&6 후부키 염동력 &f+7");
            config.set("18.9", "&0&0&0&0&0&6&6&d&7&l&6 후부키 염동력 &f+8");
            config.set("18.10", "&0&0&0&0&0&6&6&e&7&l&6 후부키 염동력 &f+9");
            config.set("18.11", "&0&0&0&0&0&6&6&f&7&l&6 후부키 염동력 &f+10");
            
            config.set("19.1", "&0&0&0&0&0&6&8&7&7&l&6 동제 머신건");
            config.set("19.2", "&0&0&0&0&0&6&8&8&7&l&6 동제 머신건 &f+1");
            config.set("19.3", "&0&0&0&0&0&6&8&9&7&l&6 동제 머신건 &f+2");
            config.set("19.4", "&0&0&0&0&0&6&8&a&7&l&6 동제 머신건 &f+3");
            config.set("19.5", "&0&0&0&0&0&6&8&b&7&l&6 동제 머신건 &f+4");
            config.set("19.6", "&0&0&0&0&0&6&8&c&7&l&6 동제 머신건 &f+5");
            config.set("19.7", "&0&0&0&0&0&6&8&d&7&l&6 동제 머신건 &f+6");
            config.set("19.8", "&0&0&0&0&0&6&8&e&7&l&6 동제 머신건 &f+7");
            config.set("19.9", "&0&0&0&0&0&6&8&f&7&l&6 동제 머신건 &f+8");
            config.set("19.10", "&0&0&0&0&0&6&9&0&7&l&6 동제 머신건 &f+9");
            config.set("19.11", "&0&0&0&0&0&6&9&1&7&l&6 동제 머신건 &f+10");
            
            config.set("20.1", "&0&0&0&0&0&7&0&0&7&l&c 불 속성 &6룬");
            config.set("20.2", "&0&0&0&0&0&7&0&1&7&l&c 불 속성 &6룬 &f+1");
            config.set("20.3", "&0&0&0&0&0&7&0&2&7&l&c 불 속성 &6룬 &f+2");
            config.set("20.4", "&0&0&0&0&0&7&0&3&7&l&c 불 속성 &6룬 &f+3");
            config.set("20.5", "&0&0&0&0&0&7&0&4&7&l&c 불 속성 &6룬 &f+4");
            config.set("20.6", "&0&0&0&0&0&7&0&5&7&l&c 불 속성 &6룬 &f+5");
            config.set("20.7", "&0&0&0&0&0&7&0&6&7&l&c 불 속성 &6룬 &f+6");
            config.set("20.8", "&0&0&0&0&0&7&0&7&7&l&c 불 속성 &6룬 &f+7");
            config.set("20.9", "&0&0&0&0&0&7&0&8&7&l&c 불 속성 &6룬 &f+8");
            config.set("20.10", "&0&0&0&0&0&7&0&9&7&l&c 불 속성 &6룬 &f+9");
            config.set("20.11", "&0&0&0&0&0&7&0&a&7&l&c 불 속성 &6룬 &f+10");
            
            config.set("21.1", "&0&0&0&0&0&7&5&8&7&l&b 바람 속성 &6룬");
            config.set("21.2", "&0&0&0&0&0&7&5&9&7&l&b 바람 속성 &6룬 &f+1");
            config.set("21.3", "&0&0&0&0&0&7&5&a&7&l&b 바람 속성 &6룬 &f+2");
            config.set("21.4", "&0&0&0&0&0&7&5&b&7&l&b 바람 속성 &6룬 &f+3");
            config.set("21.5", "&0&0&0&0&0&7&5&c&7&l&b 바람 속성 &6룬 &f+4");
            config.set("21.6", "&0&0&0&0&0&7&5&d&7&l&b 바람 속성 &6룬 &f+5");
            config.set("21.7", "&0&0&0&0&0&7&5&e&7&l&b 바람 속성 &6룬 &f+6");
            config.set("21.8", "&0&0&0&0&0&7&5&f&7&l&b 바람 속성 &6룬 &f+7");
            config.set("21.9", "&0&0&0&0&0&7&6&0&7&l&b 바람 속성 &6룬 &f+8");
            config.set("21.10", "&0&0&0&0&0&7&6&1&7&l&b 바람 속성 &6룬 &f+9");
            config.set("21.11", "&0&0&0&0&0&7&6&2&7&l&b 바람 속성 &6룬 &f+10");
            
            config.set("22.1", "&0&0&0&0&0&7&2&1&7&l&d 치유 속성 &6룬");
            config.set("22.2", "&0&0&0&0&0&7&2&2&7&l&d 치유 속성 &6룬 &f+1");
            config.set("22.3", "&0&0&0&0&0&7&2&3&7&l&d 치유 속성 &6룬 &f+2");
            config.set("22.4", "&0&0&0&0&0&7&2&4&7&l&d 치유 속성 &6룬 &f+3");
            config.set("22.5", "&0&0&0&0&0&7&2&5&7&l&d 치유 속성 &6룬 &f+4");
            config.set("22.6", "&0&0&0&0&0&7&2&6&7&l&d 치유 속성 &6룬 &f+5");
            config.set("22.7", "&0&0&0&0&0&7&2&7&7&l&d 치유 속성 &6룬 &f+6");
            config.set("22.8", "&0&0&0&0&0&7&2&8&7&l&d 치유 속성 &6룬 &f+7");
            config.set("22.9", "&0&0&0&0&0&7&2&9&7&l&d 치유 속성 &6룬 &f+8");
            config.set("22.10", "&0&0&0&0&0&7&2&a&7&l&d 치유 속성 &6룬 &f+9");
            config.set("22.11", "&0&0&0&0&0&7&2&b&7&l&d 치유 속성 &6룬 &f+10");
            
            config.set("23.1", "&0&0&0&0&0&7&2&c&7&l&7&l 어둠 속성 &6룬");
            config.set("23.2", "&0&0&0&0&0&7&2&d&7&l&7&l 어둠 속성 &6룬 &f+1");
            config.set("23.3", "&0&0&0&0&0&7&2&e&7&l&7&l 어둠 속성 &6룬 &f+2");
            config.set("23.4", "&0&0&0&0&0&7&2&f&7&l&7&l 어둠 속성 &6룬 &f+3");
            config.set("23.5", "&0&0&0&0&0&7&3&0&7&l&7&l 어둠 속성 &6룬 &f+4");
            config.set("23.6", "&0&0&0&0&0&7&3&1&7&l&7&l 어둠 속성 &6룬 &f+5");
            config.set("23.7", "&0&0&0&0&0&7&3&2&7&l&7&l 어둠 속성 &6룬 &f+6");
            config.set("23.8", "&0&0&0&0&0&7&3&3&7&l&7&l 어둠 속성 &6룬 &f+7");
            config.set("23.9", "&0&0&0&0&0&7&3&4&7&l&7&l 어둠 속성 &6룬 &f+8");
            config.set("23.10", "&0&0&0&0&0&7&3&5&7&l&7&l 어둠 속성 &6룬 &f+9");
            config.set("23.11", "&0&0&0&0&0&7&3&6&7&l&7&l 어둠 속성 &6룬 &f+10");
            
            config.set("24.1", "&0&0&0&0&0&7&3&7&7&l&a 독 속성 &6룬");
            config.set("24.2", "&0&0&0&0&0&7&3&8&7&l&a 독 속성 &6룬 &f+1");
            config.set("24.3", "&0&0&0&0&0&7&3&9&7&l&a 독 속성 &6룬 &f+2");
            config.set("24.4", "&0&0&0&0&0&7&3&a&7&l&a 독 속성 &6룬 &f+3");
            config.set("24.5", "&0&0&0&0&0&7&3&b&7&l&a 독 속성 &6룬 &f+4");
            config.set("24.6", "&0&0&0&0&0&7&3&c&7&l&a 독 속성 &6룬 &f+5");
            config.set("24.7", "&0&0&0&0&0&7&3&d&7&l&a 독 속성 &6룬 &f+6");
            config.set("24.8", "&0&0&0&0&0&7&3&e&7&l&a 독 속성 &6룬 &f+7");
            config.set("24.9", "&0&0&0&0&0&7&3&f&7&l&a 독 속성 &6룬 &f+8");
            config.set("24.10", "&0&0&0&0&0&7&4&0&7&l&a 독 속성 &6룬 &f+9");
            config.set("24.11", "&0&0&0&0&0&7&4&1&7&l&a 독 속성 &6룬 &f+10");
            
            config.set("25.1", "&0&0&0&0&0&7&4&2&7&l&e 부패 속성 &6룬");
            config.set("25.2", "&0&0&0&0&0&7&4&3&7&l&e 부패 속성 &6룬 &f+1");
            config.set("25.3", "&0&0&0&0&0&7&4&4&7&l&e 부패 속성 &6룬 &f+2");
            config.set("25.4", "&0&0&0&0&0&7&4&5&7&l&e 부패 속성 &6룬 &f+3");
            config.set("25.5", "&0&0&0&0&0&7&4&6&7&l&e 부패 속성 &6룬 &f+4");
            config.set("25.6", "&0&0&0&0&0&7&4&7&7&l&e 부패 속성 &6룬 &f+5");
            config.set("25.7", "&0&0&0&0&0&7&4&8&7&l&e 부패 속성 &6룬 &f+6");
            config.set("25.8", "&0&0&0&0&0&7&4&9&7&l&e 부패 속성 &6룬 &f+7");
            config.set("25.9", "&0&0&0&0&0&7&4&a&7&l&e 부패 속성 &6룬 &f+8");
            config.set("25.10", "&0&0&0&0&0&7&4&b&7&l&e 부패 속성 &6룬 &f+9");
            config.set("25.11", "&0&0&0&0&0&7&4&c&7&l&e 부패 속성 &6룬 &f+10");
            
            config.set("26.1", "&0&0&0&0&0&7&4&d&7&l&3 얼음 속성 &6룬");
            config.set("26.2", "&0&0&0&0&0&7&4&e&7&l&3 얼음 속성 &6룬 &f+1");
            config.set("26.3", "&0&0&0&0&0&7&4&f&7&l&3 얼음 속성 &6룬 &f+2");
            config.set("26.4", "&0&0&0&0&0&7&5&0&7&l&3 얼음 속성 &6룬 &f+3");
            config.set("26.5", "&0&0&0&0&0&7&5&1&7&l&3 얼음 속성 &6룬 &f+4");
            config.set("26.6", "&0&0&0&0&0&7&5&2&7&l&3 얼음 속성 &6룬 &f+5");
            config.set("26.7", "&0&0&0&0&0&7&5&3&7&l&3 얼음 속성 &6룬 &f+6");
            config.set("26.8", "&0&0&0&0&0&7&5&4&7&l&3 얼음 속성 &6룬 &f+7");
            config.set("26.9", "&0&0&0&0&0&7&5&5&7&l&3 얼음 속성 &6룬 &f+8");
            config.set("26.10", "&0&0&0&0&0&7&5&6&7&l&3 얼음 속성 &6룬 &f+9");
            config.set("26.11", "&0&0&0&0&0&7&5&7&7&l&3 얼음 속성 &6룬 &f+10");
            
            config.set("27.1", "&0&0&0&0&0&7&d&2&7&l&6 히든 속성 &6룬");
            config.set("27.2", "&0&0&0&0&0&7&d&3&7&l&6 히든 속성 &6룬 &f+1");
            config.set("27.3", "&0&0&0&0&0&7&d&4&7&l&6 히든 속성 &6룬 &f+2");
            config.set("27.4", "&0&0&0&0&0&7&d&5&7&l&6 히든 속성 &6룬 &f+3");
            config.set("27.5", "&0&0&0&0&0&7&d&6&7&l&6 히든 속성 &6룬 &f+4");
            config.set("27.6", "&0&0&0&0&0&7&d&7&7&l&6 히든 속성 &6룬 &f+5");
            config.set("27.7", "&0&0&0&0&0&7&d&8&7&l&6 히든 속성 &6룬 &f+6");
            config.set("27.8", "&0&0&0&0&0&7&d&9&7&l&6 히든 속성 &6룬 &f+7");
            config.set("27.9", "&0&0&0&0&0&7&d&a&7&l&6 히든 속성 &6룬 &f+8");
            config.set("27.10", "&0&0&0&0&0&7&d&b&7&l&6 히든 속성 &6룬 &f+9");
            config.set("27.11", "&0&0&0&0&0&7&d&c&7&l&6 히든 속성 &6룬 &f+10");
            
            config.set("28.1", "&0&0&0&0&0&7&c&7&7&l&6 사이타마 장갑");
            config.set("28.2", "&0&0&0&0&0&7&c&8&7&l&6 사이타마 장갑 &f+1");
            config.set("28.3", "&0&0&0&0&0&7&c&9&7&l&6 사이타마 장갑 &f+2");
            config.set("28.4", "&0&0&0&0&0&7&c&a&7&l&6 사이타마 장갑 &f+3");
            config.set("28.5", "&0&0&0&0&0&7&c&b&7&l&6 사이타마 장갑 &f+4");
            config.set("28.6", "&0&0&0&0&0&7&c&c&7&l&6 사이타마 장갑 &f+5");
            config.set("28.7", "&0&0&0&0&0&7&c&d&7&l&6 사이타마 장갑 &f+6");
            config.set("28.8", "&0&0&0&0&0&7&c&e&7&l&6 사이타마 장갑 &f+7");
            config.set("28.9", "&0&0&0&0&0&7&c&f&7&l&6 사이타마 장갑 &f+8");
            config.set("28.10", "&0&0&0&0&0&7&d&0&7&l&6 사이타마 장갑 &f+9");
            config.set("28.11", "&0&0&0&0&0&7&d&1&7&l&6 사이타마 장갑 &f+10");
            
			config.save(f);
		 } catch (IOException ioex) {
			 System.out.println("[OnePunchUpGrade] Exception Occured: " + ioex.getMessage());
			 System.out.println("========================");
			 ioex.printStackTrace();
			 System.out.println("========================");	
		 }
	}

	public static String getWaeponString(String name) {
		File f = new File("plugins/OnePunchUpGrade/Waepon.yml");
		File folder = new File("plugins/OnePunchUpGrade");
		YamlConfiguration config = YamlConfiguration.loadConfiguration(f);
		if (!f.exists()) {
			CreateWaeponConfig(f, folder, config);
		}
		
		if (config.getString(name) == null)
			return null;
		String getString = Method.replaceAllColors(config.getString(name));
		return getString;
	}
	
	public static String getWaeponOrString(String name) {
		File f = new File("plugins/OnePunchUpGrade/Waepon.yml");
		File folder = new File("plugins/OnePunchUpGrade");
		YamlConfiguration config = YamlConfiguration.loadConfiguration(f);
		if (!f.exists()) {
			CreateWaeponConfig(f, folder, config);
		}
		
		if (config.getString(name) == null)
			return null;
		String getString = config.getString(name);
		return getString;
	}

	public static void setWaeponString(String name, String amount) {
		File f = new File("plugins/OnePunchUpGrade/Waepon.yml");
		File folder = new File("plugins/OnePunchUpGrade");
		YamlConfiguration config = YamlConfiguration.loadConfiguration(f);
		try {
			if (!f.exists()) {
				CreateWaeponConfig(f, folder, config);
			}
			
			config.set(name, amount);
			config.save(f);

		} catch (IOException ioex) {
			System.out.println("[OnePunchUpGrade] Exception Occured: " + ioex.getMessage());
			System.out.println("========================");
			ioex.printStackTrace();
			System.out.println("========================");
		}
	}
}